_orgs/_posts/webServer/2014-10-25-web-server.org
#+TITLE:     Web Server
#+AUTHOR:    赵仁贵
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3$
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.c$
#+HTML_HEAD_EXTRA: <style>body {font-size:14pt} code {font-weight:bold;font-siz$
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+BEGIN_EXPORT HTML
---
layout: post
title: Web Server
author: zrg
comments: false
description: Web Server
categories:
- software
- web-server
tags:
- Apache
- WampServer
- phpStudy
- XAMPP
- WAMP
photos:
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

* Preface
* Apache
** Introduction
   Apache, Apache HTTP Server. Apache是世界使用排名第一的Web服务器软件。它可以运行在几乎所有广泛使用的计算机平台上，由于其跨平台和安全性被广泛使用，是最流行的Web服务器端软件之一。它快速、可靠并且可通过简单的API扩充，将Perl/Python等解释器编译到服务器中。同时Apache音译为阿帕奇，是北美印第安人的一个部落，叫阿帕奇族，在美国的西南部。也是一个基金会的名称、一种武装直升机等等。
** Virtual Host
*** 常见问题
1. You don't have permission to access / on this server. 
   : $ vim httpd.conf
   注意: 2.5版本需要改Require all granted
   #+begin_src shell
   allow from all
   Require all granted
   #+end_src
* Nginx
** Introdution
   Nginx (engine x) 是一个高性能的HTTP和反向代理服务，也是一个IMAP/POP3/SMTP服务。Nginx是由伊戈尔·赛索耶夫为俄罗斯访问量第二的Rambler.ru站点（俄文：Рамблер）开发的，第一个公开版本0.1.0发布于2004年10月4日。
   \\
   Apache和Nginx都有能力提供每秒钟庞大的请求服务，但是随着并发数量的增加，Apache的性能开始下降，然而Nginx的性能几乎不会下降。 
   这里最好的一点是：因为Nginx是基于事件的，它不用为每个请求产生新的进程或线程，所以它的内存使用很低。
** Nginx 的事件处理机制
   1. 一个基本的 Web 服务器来说，事件通常有 3种类型，即网络事件、信号、定时器。 
   2. Nginx 通过异步非阻塞机制，实现由进程循环处理多个准备好的事件，从而实现高并发和轻量级。
** Nginx 的内部模型
** Nginx 开启和关闭
   : $ cd nginx 
   : $ start nginx 
   : $ nginx -s stop          // 停止nginx 
   : $ nginx -s reload       // 重新加载配置文件 
   : $ nginx -s quit          // 退出nginx
