_posts/webServer/2014-10-25-web-server.html
---
layout: post
title: Web Server
author: zrg
comments: false
description: Web Server
categories:
- software
- web-server
tags:
- Apache
- WampServer
- phpStudy
- XAMPP
- WAMP
photos:
---

<div id="outline-container-org9a647a4" class="outline-2">
<h2 id="org9a647a4"><span class="section-number-2">1</span> Preface</h2>
</div>
<div id="outline-container-orga336f99" class="outline-2">
<h2 id="orga336f99"><span class="section-number-2">2</span> Apache</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgaf18011" class="outline-3">
<h3 id="orgaf18011"><span class="section-number-3">2.1</span> Introduction</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Apache, Apache HTTP Server. Apache是世界使用排名第一的Web服务器软件。它可以运行在几乎所有广泛使用的计算机平台上，由于其跨平台和安全性被广泛使用，是最流行的Web服务器端软件之一。它快速、可靠并且可通过简单的API扩充，将Perl/Python等解释器编译到服务器中。同时Apache音译为阿帕奇，是北美印第安人的一个部落，叫阿帕奇族，在美国的西南部。也是一个基金会的名称、一种武装直升机等等。
</p>
</div>
</div>
<div id="outline-container-org2c56c62" class="outline-3">
<h3 id="org2c56c62"><span class="section-number-3">2.2</span> Virtual Host</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgfe26bd4" class="outline-4">
<h4 id="orgfe26bd4"><span class="section-number-4">2.2.1</span> 常见问题</h4>
<div class="outline-text-4" id="text-2-2-1">
<ol class="org-ol">
<li><p>
You don't have permission to access / on this server. 
</p>
<pre class="example">
$ vim httpd.conf
</pre>

<p>
注意: 2.5版本需要改Require all granted
</p>
<div class="org-src-container">
<pre class="src src-shell">allow from all
Require all granted
</pre>
</div></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-org7ad8d5a" class="outline-2">
<h2 id="org7ad8d5a"><span class="section-number-2">3</span> Nginx</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2a8e6ed" class="outline-3">
<h3 id="org2a8e6ed"><span class="section-number-3">3.1</span> Introdution</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Nginx (engine x) 是一个高性能的HTTP和反向代理服务，也是一个IMAP/POP3/SMTP服务。Nginx是由伊戈尔·赛索耶夫为俄罗斯访问量第二的Rambler.ru站点（俄文：Рамблер）开发的，第一个公开版本0.1.0发布于2004年10月4日。
<br />
Apache和Nginx都有能力提供每秒钟庞大的请求服务，但是随着并发数量的增加，Apache的性能开始下降，然而Nginx的性能几乎不会下降。 
这里最好的一点是：因为Nginx是基于事件的，它不用为每个请求产生新的进程或线程，所以它的内存使用很低。
</p>
</div>
</div>
<div id="outline-container-orgeca4624" class="outline-3">
<h3 id="orgeca4624"><span class="section-number-3">3.2</span> Nginx 的事件处理机制</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>一个基本的 Web 服务器来说，事件通常有 3种类型，即网络事件、信号、定时器。</li>
<li>Nginx 通过异步非阻塞机制，实现由进程循环处理多个准备好的事件，从而实现高并发和轻量级。</li>
</ol>
</div>
</div>
<div id="outline-container-org4f65949" class="outline-3">
<h3 id="org4f65949"><span class="section-number-3">3.3</span> Nginx 的内部模型</h3>
</div>
<div id="outline-container-org23c2a4c" class="outline-3">
<h3 id="org23c2a4c"><span class="section-number-3">3.4</span> Nginx 开启和关闭</h3>
<div class="outline-text-3" id="text-3-4">
<pre class="example">
$ cd nginx 
$ start nginx 
$ nginx -s stop          // 停止nginx 
$ nginx -s reload       // 重新加载配置文件 
$ nginx -s quit          // 退出nginx
</pre>
</div>
</div>
