_orgs/_posts/webServer/2014-10-25-web-server.org
** Nginx 配置
   #+begin_src shell
   #user  nobody; 
   worker_processes  1; 
     
   #error_log  logs/error.log; 
   #error_log  logs/error.log  notice; 
   #error_log  logs/error.log  info; 
     
   #pid        logs/nginx.pid; 
     
   events { 
       worker_connections  1024; 
   } 
     
   http { 
       include       mime.types; 
       default_type  application/octet-stream; 
     
       log_format  main  '$remote_addr - $remote_user [$time_local] "$request" ' 
                         '$status $body_bytes_sent "$http_referer" ' 
                         '"$http_user_agent" "$http_x_forwarded_for"'; 
     
       access_log  logs/access.log  main; 
     
       sendfile        on; 
       #tcp_nopush     on; 
     
       #keepalive_timeout  0; 
       keepalive_timeout  65; 
     
       #gzip  on;
       autoindex on; #开启nginx目录浏览功能 
       autoindex_exact_size off; #文件大小从KB开始显示 
       autoindex_localtime on; #显示文件修改时间为服务器本地时间
       #proxy_ignore_client_abort on; # 没有解决问题，原先为了解决An error occurred. 
  
    server { 
        listen       100; 
        server_name  localhost; 
  
        #charset koi8-r; 
  
        #access_log  logs/host.access.log  main; 
  
        location / { 
            root   html; 
            index  index.html index.htm index.php; 
        } 
  
charset GBK; #设置编码 
  
        #error_page  404              /404.html; 
  
        # redirect server error pages to the static page /50x.html 
        # 
        error_page   500 502 503 504  /50x.html; 
        location = /50x.html { 
            root   html; 
        } 
  
        # proxy the PHP scripts to Apache listening on 127.0.0.1:80 
        # 
        #location ~ \.php$ { 
        #    proxy_pass   http://127.0.0.1; 
        #} 
  
        # pass the PHP scripts to FastCGI server listening on 127.0.0.1:9000 
        #
        location ~ \.php$ { 
            root           D:/nginx/html; 
            fastcgi_pass   127.0.0.1:9000; 
            fastcgi_index  index.php; 
            fastcgi_param  SCRIPT_FILENAME  $document_root$fastcgi_script_name; 
            include        fastcgi_params; 
        } 
  
        # deny access to .htaccess files, if Apache's document root 
        # concurs with nginx's one 
        # 
        location ~ /\.ht { 
            deny  all; 
        } 
    } 
     # another virtual host using mix of IP-, name-, and port-based configuration 
    # 
    #server { 
    #    listen       8000; 
    #    listen       somename:8080; 
    #    server_name  somename  alias  another.alias; 
  
    #    location / { 
    #        root   html; 
    #        index  index.html index.htm; 
    #    } 
    #} 
 
    # HTTPS server 
    # 
    #server { 
    #    listen       443 ssl; 
    #    server_name  localhost; 
  
    #    ssl_certificate      cert.pem; 
    #    ssl_certificate_key  cert.key;
    #    ssl_session_cache    shared:SSL:1m; 
    #    ssl_session_timeout  5m; 
  
    #    ssl_ciphers  HIGH:!aNULL:!MD5; 
    #    ssl_prefer_server_ciphers  on; 
  
    #    location / { 
    #        root   html; 
    #        index  index.html index.htm; 
    #    } 
    #} 
} 
   #+end_src
