_posts/webServer/2014-10-25-web-server.html
<div id="outline-container-org30200b0" class="outline-3">
<h3 id="org30200b0"><span class="section-number-3">3.5</span> Nginx 配置</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-shell">   <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">user&#8239; nobody; </span>
   worker_processes&#8239; 1; 
   &#8239; 
   <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">error_log&#8239; logs/error.log; </span>
   <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">error_log&#8239; logs/error.log&#8239; notice; </span>
   <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">error_log&#8239; logs/error.log&#8239; info; </span>
   &#8239; 
   <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">pid&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; logs/nginx.pid; </span>
   &#8239; 
   events { 
   &#8239;&#8239;&#8239; worker_connections&#8239; 1024; 
   } 
   &#8239; 
   http { 
   &#8239;&#8239;&#8239; include&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; mime.types; 
   &#8239;&#8239;&#8239; default_type&#8239; application/octet-stream; 
   &#8239; 
   &#8239;&#8239;&#8239; log_format&#8239; main&#8239; <span style="color: #ffd866;">'$remote_addr - $remote_user [$time_local] "$request" '</span> 
   &#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #ffd866;">'$status $body_bytes_sent "$http_referer" '</span> 
   &#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #ffd866;">'"$http_user_agent" "$http_x_forwarded_for"'</span>; 
   &#8239; 
   &#8239;&#8239;&#8239; access_log&#8239; logs/access.log&#8239; main; 
   &#8239; 
   &#8239;&#8239;&#8239; sendfile&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; on; 
   &#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">tcp_nopush&#8239;&#8239;&#8239;&#8239; on; </span>
   &#8239; 
   &#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">keepalive_timeout&#8239; 0; </span>
   &#8239;&#8239;&#8239; keepalive_timeout&#8239; 65; 
   &#8239; 
   &#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">gzip&#8239; on;</span>
       autoindex on; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#24320;&#21551;nginx&#30446;&#24405;&#27983;&#35272;&#21151;&#33021; </span>
       autoindex_exact_size off; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#25991;&#20214;&#22823;&#23567;&#20174;KB&#24320;&#22987;&#26174;&#31034; </span>
       autoindex_localtime on; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#26174;&#31034;&#25991;&#20214;&#20462;&#25913;&#26102;&#38388;&#20026;&#26381;&#21153;&#22120;&#26412;&#22320;&#26102;&#38388;</span>
       <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">proxy_ignore_client_abort on; # &#27809;&#26377;&#35299;&#20915;&#38382;&#39064;&#65292;&#21407;&#20808;&#20026;&#20102;&#35299;&#20915;An error occurred. </span>
&#8239; 
&#8239;&#8239;&#8239; server { 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; listen&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; 100; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; server_name&#8239; localhost; 
&#8239; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">charset koi8-r; </span>
&#8239; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">access_log&#8239; logs/host.access.log&#8239; main; </span>
&#8239; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; location / { 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; root&#8239;&#8239; html; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; index&#8239; index.html index.htm index.php; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; } 
&#8239; 
charset GBK; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#35774;&#32622;&#32534;&#30721; </span>
&#8239; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">error_page&#8239; 404&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; /404.html; </span>
&#8239; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;"># </span><span style="color: #727072; font-style: italic;">redirect server error pages to the static page /50x.html </span>
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;"># </span>
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; error_page&#8239;&#8239; 500 502 503 504&#8239; /50x.html; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; location = /50x.html { 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; root&#8239;&#8239; html; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; } 
&#8239; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;"># </span><span style="color: #727072; font-style: italic;">proxy the PHP scripts to Apache listening on 127.0.0.1:80 </span>
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;"># </span>
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">location ~ \.php$ { </span>
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; proxy_pass&#8239;&#8239; http://127.0.0.1; </span>
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">} </span>
&#8239; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;"># </span><span style="color: #727072; font-style: italic;">pass the PHP scripts to FastCGI server listening on 127.0.0.1:9000 </span>
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;">#</span>
        location ~ <span style="color: #ffd866;">\.</span>php$ { 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; root&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; D:/nginx/html; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; fastcgi_pass&#8239;&#8239; 127.0.0.1:9000; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; fastcgi_index&#8239; index.php; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; fastcgi_param&#8239; SCRIPT_FILENAME&#8239; $<span style="color: #fcfcfa;">document_root</span>$<span style="color: #fcfcfa;">fastcgi_script_name</span>; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; include&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; fastcgi_params; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; } 
&#8239; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;"># </span><span style="color: #727072; font-style: italic;">deny access to .htaccess files, if Apache's document root </span>
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;"># </span><span style="color: #727072; font-style: italic;">concurs with nginx's one </span>
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;"># </span>
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; location ~ /<span style="color: #ffd866;">\.</span>ht { 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; deny&#8239; all; 
&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; } 
&#8239;&#8239;&#8239; } 
&#8239;&#8239;&#8239;&#8239; <span style="color: #727072;"># </span><span style="color: #727072; font-style: italic;">another virtual host using mix of IP-, name-, and port-based configuration </span>
&#8239;&#8239;&#8239; <span style="color: #727072;"># </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">server { </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; listen&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; 8000; </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; listen&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; somename:8080; </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; server_name&#8239; somename&#8239; alias&#8239; another.alias; </span>
&#8239; 
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; location / { </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; root&#8239;&#8239; html; </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; index&#8239; index.html index.htm; </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; } </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">} </span>

&#8239;&#8239;&#8239; <span style="color: #727072;"># </span><span style="color: #727072; font-style: italic;">HTTPS server </span>
&#8239;&#8239;&#8239; <span style="color: #727072;"># </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">server { </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; listen&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; 443 ssl; </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; server_name&#8239; localhost; </span>
&#8239; 
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; ssl_certificate&#8239;&#8239;&#8239;&#8239;&#8239; cert.pem; </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; ssl_certificate_key&#8239; cert.key;</span>
    <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; ssl_session_cache&#8239;&#8239;&#8239; shared:SSL:1m; </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; ssl_session_timeout&#8239; 5m; </span>
&#8239; 
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; ssl_ciphers&#8239; HIGH:!aNULL:!MD5; </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; ssl_prefer_server_ciphers&#8239; on; </span>
&#8239; 
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; location / { </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; root&#8239;&#8239; html; </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; index&#8239; index.html index.htm; </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">&#8239;&#8239;&#8239; } </span>
&#8239;&#8239;&#8239; <span style="color: #727072;">#</span><span style="color: #727072; font-style: italic;">} </span>
} 
</pre>
</div>
</div>
</div>
</div>
