_orgs/_posts/webServer/2014-10-25-web-server.org
* IIS(Internet Information Services)
** IIS 常见问题及解决办法
*** 关闭IIS或sql server占用的80端口 
1. 打开IIS信息管理器，停止IIS服务 
2. 打开SQL Server配置管理器，停止SQL Server Reporting Services服务 
*** 停止IIS服务 
1. 停止IIS网站服务（通过鼠标） 
2. 命令行输入net stop iisadmin 
3. 命令行输入 
   : $ netstat -ano //列出端口情况 
   : $ tasklist|findstr "80" //查看哪个进程占用了80端口 
   : $ netstat -ano|findstr "80" //查看被占用的80端口对应的pid 
   : $ taskkill /pid 1676 //根据pid终止进程  
   : $ taskkill /f /t /im httpd.exe 终止该进程 
4. windows 7,直接进入服务停止World Wide Web Publishing Service 
5. SQL server在占用80端口，去停止相关服务。 
6. 注意：sql server中的SQL Server Reporting Service服务也会占用80端口，pid 4 
*** IIS 403 错误
可能原因为功能缺失,使用 Windows 自带添加功能引导安装功能.
* Tomcat
** Indroduction
Tomcat是Apache 软件基金会（Apache Software Foundation）的Jakarta 项目中的一个核心项目，由Apache、Sun 和其他一些公司及个人共同开发而成。
** 安装及配置
*** WEB-INF 目录
1. WEB-INF是JAVA的WEB应用的安全目录。所谓安全就是客户端无法访问，只有服务端可以访问的目录。 
2. web.xml,项目部署文件 
3. classes文件夹，用以放置*.class文件 
4. lib文件夹，用于存放需要的jar包 
*** 定时重启 Tomcat
    : $ vim tomcat_restart.bat
    #+begin_src shell
    @echo restart tomcat8 service, log to C:\tomcat_restart.log 
    @echo 1. stop tomcat8 service 
    @echo 2. sleep 10 seconds 
    @echo 3. start tomcat8 service 
    echo ---------------------------------------------》 C:\tomcat_restart.log 
    echo [%date%%time%] 准备重新启动tomcat 》C:\tomcat_restart.log 
    echo [%date%%time%] 停止服务 》 C:\tomcat_restart.log 
    net stop tomcat8》 C:\tomcat_restart.log 
    @echo等待 10 seconds 
    ping -n 10 127.0.0.1 
    echo [%date%%time%] 重新启动 》 C:\tomcat_restart.log 
    net start tomcat8 》 C:\tomcat_restart.log 
    echo------------------------------------ 》C:\tomcat_restart.log 
    #+end_src
** 常见问题
1. 运行startup.bat没有启动，报错：TOMCAT JAVA_HOME or JRE_HOME environment variable is not defined correctly 
   原因分析及解决办法:
   \\
   分析startup.bat启动脚本：
   \\
   发现其调用了catalina.bat,而catalina.bat调用了setclasspath.bat；在setclasspath.bat的头部定义了JAVA_HOME和JRE_HOME的值，那么在这里手动设置JAVA_HOME变量.
   #+begin_src shell
   set JAVA_HOME=C:\Program Files\Java\jdk1.5.0_05 
   set JRE_HOME=C:\Program Files\Java\jre1.5.0_05 
   #+end_src
* 集成 Web Server
** wamp
** WampServer
*** 修改 www 目录
1. 打开http.conf，搜索documentroot和directory，修改指定的WWW路径。 
2. 打开wampmanager.ini，搜索Menu.Left，修改指定的WWW路径。 
3. 重启服务，完成。
*** 添加apache、php、mysql版本
根据/scripts/config.inc.php中定义的全局变量和checkApacheConf函数。需要添加一个wampserver.conf文件。这样的话，才能告诉wampserver.exe，我们已经有一个有效的apache、MySQL、PHP版本了。 
1. 添加 Apache 版本
   下载自己需要的apache版本，解压到/bin/apache/目录下》 从wamp自带的apahce版本里找到wampserver.conf 文件》复制粘贴》退出wampserver》重新启动wampserver。
2. 添加 PHP 版本
   下载自己需要的php版本，解压到/bin/php/目录下》 从wamp自带的php版本里找到 wampserver.conf 文件》然后复制php.ini-development重命名为php.ini》打开php.ini,指定扩展目录和做相关配置》另存为phpForApache.ini》退出wampserver》重新启动wampserver. 
   \\
   注意：添加PHP7的时候，需要改动wampserver.conf内容： 
   : $phpConf['apache']['2.4']['LoadModuleName'] = 'php7_module'; 
   : $phpConf['apache']['2.4']['LoadModuleFile'] = 'php7apache2_4.dll'; 
3. 添加 MySQL 版本
   下载自己需要的mysql版本，将下载的文件解压缩到/bin/mysql/目录下》 从wamp自带的mysql版本里找到 wampserver.conf 文件》复制粘贴》退出wampserver》重新启动wampserver。 
*** 常见问题
1. 访问phpmyadmin时，出现You don't have permission to access /phpmyadmin/ on this server. 
   #+begin_src shell
   allow from all
   # 注意2.5版本需要改:
   Require all granted
   #+end_src
2. phpMyAdmin 配置文件
   + config.default.php
   + config.inc.php
** xampp
*** 下载和安装
    #+BEGIN_SRC emacs-lisp
 官网地址：https://www.apachefriends.org
 下载时，有32位的、64位的，看你的系统支持那个就下哪个。
 安装：#./packgeName.run
 等待安装结束，期间会提示你是否执行，输入y即可。
 卸载：到安装目录/opt/lampp/中找到uninstall，执行即可卸载
 注意：在执行.run文件时无提示，原因是你软件与系统位数不对应，换成64或32位的执行就ok了
    #+END_SRC
**** 配置访问
***** 相关路径
      #+BEGIN_SRC emacs-lisp
  /opt/lampp/主目录
  /opt/lampp/htdocs/xampp/网站存放目录
  /opt/lampp/etc/配置文件存放目录
      #+END_SRC
***** 使外部网络能正常访问
      #+BEGIN_SRC emacs-lisp
  #vim /opt/lampp/etc/extra/httpd-xampp.conf
  找到修改：
  <LocationMatch "^/(?i:(?:xampp|security|licenses|phpmyadmin|webalizer|server-status|server-info))">
  #        Require local   #注释掉
         Order deny,allow  #添加
         Allow from all    #添加，表示允许所有都能访问
         ErrorDocument 403 /error/XAMPP_FORBIDDEN.html.var
  </LocationMatch>
      #+END_SRC
***** 启动服务
      : /opt/lampp/lampp start
      : 就这么简单，用浏览器访问一下吧！
*** 当访问时，出现权限问题
    #+BEGIN_SRC emacs-lisp
 Access forbidden!
 New XAMPP security concept:
 Access to the requested object is only available from the local network.
 This setting can be configured in the file "httpd-xampp.conf".
 Error 403
 这个原因就是上面提到的修改httpd-xampp.conf文件，改了就能正常访问了。
    #+END_SRC
