_posts/webServer/2014-10-25-web-server.html
<div id="outline-container-orgba1d93d" class="outline-2">
<h2 id="orgba1d93d"><span class="section-number-2">4</span> IIS(Internet Information Services)</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgfb8ef16" class="outline-3">
<h3 id="orgfb8ef16"><span class="section-number-3">4.1</span> IIS 常见问题及解决办法</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org6168d9c" class="outline-4">
<h4 id="org6168d9c"><span class="section-number-4">4.1.1</span> 关闭IIS或sql server占用的80端口</h4>
<div class="outline-text-4" id="text-4-1-1">
<ol class="org-ol">
<li>打开IIS信息管理器，停止IIS服务</li>
<li>打开SQL Server配置管理器，停止SQL Server Reporting Services服务</li>
</ol>
</div>
</div>
<div id="outline-container-org329006f" class="outline-4">
<h4 id="org329006f"><span class="section-number-4">4.1.2</span> 停止IIS服务</h4>
<div class="outline-text-4" id="text-4-1-2">
<ol class="org-ol">
<li>停止IIS网站服务（通过鼠标）</li>
<li>命令行输入net stop iisadmin</li>
<li><p>
命令行输入 
</p>
<pre class="example">
$ netstat -ano //列出端口情况 
$ tasklist|findstr "80" //查看哪个进程占用了80端口 
$ netstat -ano|findstr "80" //查看被占用的80端口对应的pid 
$ taskkill /pid 1676 //根据pid终止进程  
$ taskkill /f /t /im httpd.exe 终止该进程 
</pre></li>
<li>windows 7,直接进入服务停止World Wide Web Publishing Service</li>
<li>SQL server在占用80端口，去停止相关服务。</li>
<li>注意：sql server中的SQL Server Reporting Service服务也会占用80端口，pid 4</li>
</ol>
</div>
</div>
<div id="outline-container-org3995135" class="outline-4">
<h4 id="org3995135"><span class="section-number-4">4.1.3</span> IIS 403 错误</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
可能原因为功能缺失,使用 Windows 自带添加功能引导安装功能.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbb182ec" class="outline-2">
<h2 id="orgbb182ec"><span class="section-number-2">5</span> Tomcat</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org11f69a3" class="outline-3">
<h3 id="org11f69a3"><span class="section-number-3">5.1</span> Indroduction</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Tomcat是Apache 软件基金会（Apache Software Foundation）的Jakarta 项目中的一个核心项目，由Apache、Sun 和其他一些公司及个人共同开发而成。
</p>
</div>
</div>
<div id="outline-container-orgfd75263" class="outline-3">
<h3 id="orgfd75263"><span class="section-number-3">5.2</span> 安装及配置</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org545e4c6" class="outline-4">
<h4 id="org545e4c6"><span class="section-number-4">5.2.1</span> WEB-INF 目录</h4>
<div class="outline-text-4" id="text-5-2-1">
<ol class="org-ol">
<li>WEB-INF是JAVA的WEB应用的安全目录。所谓安全就是客户端无法访问，只有服务端可以访问的目录。</li>
<li>web.xml,项目部署文件</li>
<li>classes文件夹，用以放置*.class文件</li>
<li>lib文件夹，用于存放需要的jar包</li>
</ol>
</div>
</div>
<div id="outline-container-orge16cad9" class="outline-4">
<h4 id="orge16cad9"><span class="section-number-4">5.2.2</span> 定时重启 Tomcat</h4>
<div class="outline-text-4" id="text-5-2-2">
<pre class="example">
$ vim tomcat_restart.bat
</pre>

<div class="org-src-container">
<pre class="src src-shell">@echo restart tomcat8 service, log to C:\tomcat_restart.log 
@echo 1. stop tomcat8 service 
@echo 2. sleep 10 seconds 
@echo 3. start tomcat8 service 
<span style="color: #ab9df2;">echo</span> ---------------------------------------------&#12299; C:\tomcat_restart.log 
<span style="color: #ab9df2;">echo</span> [%date%%time%] &#20934;&#22791;&#37325;&#26032;&#21551;&#21160;tomcat &#12299;C:\tomcat_restart.log 
<span style="color: #ab9df2;">echo</span> [%date%%time%] &#20572;&#27490;&#26381;&#21153; &#12299; C:\tomcat_restart.log 
net stop tomcat8&#12299; C:\tomcat_restart.log 
@echo&#31561;&#24453; 10 seconds 
ping -n 10 127.0.0.1 
<span style="color: #ab9df2;">echo</span> [%date%%time%] &#37325;&#26032;&#21551;&#21160; &#12299; C:\tomcat_restart.log 
net start tomcat8 &#12299; C:\tomcat_restart.log 
echo------------------------------------ &#12299;C:\tomcat_restart.log 
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb7bad4f" class="outline-3">
<h3 id="orgb7bad4f"><span class="section-number-3">5.3</span> 常见问题</h3>
<div class="outline-text-3" id="text-5-3">
<ol class="org-ol">
<li><p>
运行startup.bat没有启动，报错：TOMCAT JAVA_HOME or JRE_HOME environment variable is not defined correctly 
原因分析及解决办法:
<br />
分析startup.bat启动脚本：
<br />
发现其调用了catalina.bat,而catalina.bat调用了setclasspath.bat；在setclasspath.bat的头部定义了JAVA_HOME和JRE_HOME的值，那么在这里手动设置JAVA_HOME变量.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ab9df2;">set</span> <span style="color: #fcfcfa;">JAVA_HOME</span>=C:\Program Files\Java\jdk1.5.0_05 
<span style="color: #ab9df2;">set</span> <span style="color: #fcfcfa;">JRE_HOME</span>=C:\Program Files\Java\jre1.5.0_05 
</pre>
</div></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgf231475" class="outline-2">
<h2 id="orgf231475"><span class="section-number-2">6</span> 集成 Web Server</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org6d14e14" class="outline-3">
<h3 id="org6d14e14"><span class="section-number-3">6.1</span> wamp</h3>
</div>
<div id="outline-container-org7862e0d" class="outline-3">
<h3 id="org7862e0d"><span class="section-number-3">6.2</span> WampServer</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-org7b5c3f7" class="outline-4">
<h4 id="org7b5c3f7"><span class="section-number-4">6.2.1</span> 修改 www 目录</h4>
<div class="outline-text-4" id="text-6-2-1">
<ol class="org-ol">
<li>打开http.conf，搜索documentroot和directory，修改指定的WWW路径。</li>
<li>打开wampmanager.ini，搜索Menu.Left，修改指定的WWW路径。</li>
<li>重启服务，完成。</li>
</ol>
</div>
</div>
<div id="outline-container-orgee1a322" class="outline-4">
<h4 id="orgee1a322"><span class="section-number-4">6.2.2</span> 添加apache、php、mysql版本</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
根据/scripts/config.inc.php中定义的全局变量和checkApacheConf函数。需要添加一个wampserver.conf文件。这样的话，才能告诉wampserver.exe，我们已经有一个有效的apache、MySQL、PHP版本了。 
</p>
<ol class="org-ol">
<li>添加 Apache 版本
下载自己需要的apache版本，解压到/bin/apache/目录下》 从wamp自带的apahce版本里找到wampserver.conf 文件》复制粘贴》退出wampserver》重新启动wampserver。</li>
<li><p>
添加 PHP 版本
下载自己需要的php版本，解压到/bin/php/目录下》 从wamp自带的php版本里找到 wampserver.conf 文件》然后复制php.ini-development重命名为php.ini》打开php.ini,指定扩展目录和做相关配置》另存为phpForApache.ini》退出wampserver》重新启动wampserver. 
<br />
注意：添加PHP7的时候，需要改动wampserver.conf内容： 
</p>
<pre class="example">
$phpConf['apache']['2.4']['LoadModuleName'] = 'php7_module'; 
$phpConf['apache']['2.4']['LoadModuleFile'] = 'php7apache2_4.dll'; 
</pre></li>
<li>添加 MySQL 版本
下载自己需要的mysql版本，将下载的文件解压缩到/bin/mysql/目录下》 从wamp自带的mysql版本里找到 wampserver.conf 文件》复制粘贴》退出wampserver》重新启动wampserver。</li>
</ol>
</div>
</div>
<div id="outline-container-orgcd958d8" class="outline-4">
<h4 id="orgcd958d8"><span class="section-number-4">6.2.3</span> 常见问题</h4>
<div class="outline-text-4" id="text-6-2-3">
<ol class="org-ol">
<li><p>
访问phpmyadmin时，出现You don't have permission to access <i>phpmyadmin</i> on this server. 
</p>
<div class="org-src-container">
<pre class="src src-shell">allow from all
<span style="color: #727072;"># </span><span style="color: #727072; font-style: italic;">&#27880;&#24847;2.5&#29256;&#26412;&#38656;&#35201;&#25913;:</span>
Require all granted
</pre>
</div></li>
<li>phpMyAdmin 配置文件
<ul class="org-ul">
<li>config.default.php</li>
<li>config.inc.php</li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgb561475" class="outline-3">
<h3 id="orgb561475"><span class="section-number-3">6.3</span> xampp</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-orgf5159ba" class="outline-4">
<h4 id="orgf5159ba"><span class="section-number-4">6.3.1</span> 下载和安装</h4>
<div class="outline-text-4" id="text-6-3-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">     &#23448;&#32593;&#22320;&#22336;&#65306;https://www.apachefriends.org
     &#19979;&#36733;&#26102;&#65292;&#26377;32&#20301;&#30340;&#12289;64&#20301;&#30340;&#65292;&#30475;&#20320;&#30340;&#31995;&#32479;&#25903;&#25345;&#37027;&#20010;&#23601;&#19979;&#21738;&#20010;&#12290;
     &#23433;&#35013;&#65306;#./packgeName.run
     &#31561;&#24453;&#23433;&#35013;&#32467;&#26463;&#65292;&#26399;&#38388;&#20250;&#25552;&#31034;&#20320;&#26159;&#21542;&#25191;&#34892;&#65292;&#36755;&#20837;y&#21363;&#21487;&#12290;
     &#21368;&#36733;&#65306;&#21040;&#23433;&#35013;&#30446;&#24405;/opt/lampp/&#20013;&#25214;&#21040;uninstall&#65292;&#25191;&#34892;&#21363;&#21487;&#21368;&#36733;
     &#27880;&#24847;&#65306;&#22312;&#25191;&#34892;.run&#25991;&#20214;&#26102;&#26080;&#25552;&#31034;&#65292;&#21407;&#22240;&#26159;&#20320;&#36719;&#20214;&#19982;&#31995;&#32479;&#20301;&#25968;&#19981;&#23545;&#24212;&#65292;&#25442;&#25104;64&#25110;32&#20301;&#30340;&#25191;&#34892;&#23601;ok&#20102;
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org07c2eaf"></a>配置访问<br />
<ol class="org-ol">
<li><a id="orge97afad"></a>相关路径<br />
<div class="outline-text-6" id="text-6-3-1-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">/opt/lampp/&#20027;&#30446;&#24405;
/opt/lampp/htdocs/xampp/&#32593;&#31449;&#23384;&#25918;&#30446;&#24405;
/opt/lampp/etc/&#37197;&#32622;&#25991;&#20214;&#23384;&#25918;&#30446;&#24405;
</pre>
</div>
</div>
</li>
<li><a id="org9c2ca31"></a>使外部网络能正常访问<br />
<div class="outline-text-6" id="text-6-3-1-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">#vim /opt/lampp/etc/extra/httpd-xampp.conf
&#25214;&#21040;&#20462;&#25913;&#65306;
&lt;LocationMatch <span style="color: #ffd866;">"^/(?i:(?:xampp|security|licenses|phpmyadmin|webalizer|server-status|server-info))"</span>&gt;
#        Require local   #&#27880;&#37322;&#25481;
       Order deny,allow  #&#28155;&#21152;
       Allow from all    #&#28155;&#21152;&#65292;&#34920;&#31034;&#20801;&#35768;&#25152;&#26377;&#37117;&#33021;&#35775;&#38382;
       ErrorDocument 403 /error/XAMPP_FORBIDDEN.html.var
&lt;/LocationMatch&gt;
</pre>
</div>
</div>
</li>
<li><a id="orgad9848e"></a>启动服务<br />
<div class="outline-text-6" id="text-6-3-1-1-3">
<pre class="example">
/opt/lampp/lampp start
就这么简单，用浏览器访问一下吧！
</pre>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgd449a5d" class="outline-4">
<h4 id="orgd449a5d"><span class="section-number-4">6.3.2</span> 当访问时，出现权限问题</h4>
<div class="outline-text-4" id="text-6-3-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">Access forbidden!
New XAMPP security concept:
Access to the requested object is only available from the local network.
This setting can be configured in the file <span style="color: #ffd866;">"httpd-xampp.conf"</span>.
Error 403
&#36825;&#20010;&#21407;&#22240;&#23601;&#26159;&#19978;&#38754;&#25552;&#21040;&#30340;&#20462;&#25913;httpd-xampp.conf&#25991;&#20214;&#65292;&#25913;&#20102;&#23601;&#33021;&#27491;&#24120;&#35775;&#38382;&#20102;&#12290;
</pre>
</div>
</div>
</div>
