_orgs/_posts/webServer/2014-10-25-web-server.org
*** 重启后不能启动xampp服务
    #+BEGIN_SRC emacs-lisp
 由于断电或其他原因，重启后服务没能开启，网站不能访问了
 a.进入 /etc/init.d 目录下，建立 lampp.sh文件
 #vim lampp.sh
 b.输入如下内容
 #!/bin/sh
 cd /opt/lampp
 ./lampp start
 c.更改文件权限
 #chmod 755 lampp.sh
 d.编辑 /etc/rc.d/rc.local ,在最后一行后面加上:
 exec /etc/init.d/lampp.sh
 如此，开机就能启动xampp了。
    #+END_SRC
*** 有时会因为防火墙原因，导致不能访问网站
    #+BEGIN_SRC emacs-lisp
 此时，我们可以关闭防火墙，并且重启后不开启
 chkconfig iptables off 关闭防火墙
 systemctl stop firewalled.service --Centos中使用
 systemctl disable firewalled.service --重启后不开启防火墙
    #+END_SRC

** phpStudy
* References
  + [[https://baike.baidu.com/item/apache/6265][apache 百度百科]]
