_posts/webServer/2014-10-25-web-server.html
<div id="outline-container-org84de770" class="outline-4">
<h4 id="org84de770"><span class="section-number-4">6.3.3</span> 重启后不能启动xampp服务</h4>
<div class="outline-text-4" id="text-6-3-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">&#30001;&#20110;&#26029;&#30005;&#25110;&#20854;&#20182;&#21407;&#22240;&#65292;&#37325;&#21551;&#21518;&#26381;&#21153;&#27809;&#33021;&#24320;&#21551;&#65292;&#32593;&#31449;&#19981;&#33021;&#35775;&#38382;&#20102;
a.&#36827;&#20837; /etc/init.d &#30446;&#24405;&#19979;&#65292;&#24314;&#31435; lampp.sh&#25991;&#20214;
#vim lampp.sh
b.&#36755;&#20837;&#22914;&#19979;&#20869;&#23481;
#!/bin/sh
cd /opt/lampp
./lampp start
c.&#26356;&#25913;&#25991;&#20214;&#26435;&#38480;
#chmod 755 lampp.sh
d.&#32534;&#36753; /etc/rc.d/rc.local ,&#22312;&#26368;&#21518;&#19968;&#34892;&#21518;&#38754;&#21152;&#19978;:
exec /etc/init.d/lampp.sh
&#22914;&#27492;&#65292;&#24320;&#26426;&#23601;&#33021;&#21551;&#21160;xampp&#20102;&#12290;
</pre>
</div>
</div>
</div>
<div id="outline-container-org737fc69" class="outline-4">
<h4 id="org737fc69"><span class="section-number-4">6.3.4</span> 有时会因为防火墙原因，导致不能访问网站</h4>
<div class="outline-text-4" id="text-6-3-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">&#27492;&#26102;&#65292;&#25105;&#20204;&#21487;&#20197;&#20851;&#38381;&#38450;&#28779;&#22681;&#65292;&#24182;&#19988;&#37325;&#21551;&#21518;&#19981;&#24320;&#21551;
chkconfig iptables off &#20851;&#38381;&#38450;&#28779;&#22681;
systemctl stop firewalled.service --Centos&#20013;&#20351;&#29992;
systemctl disable firewalled.service --&#37325;&#21551;&#21518;&#19981;&#24320;&#21551;&#38450;&#28779;&#22681;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgaad2a3a" class="outline-3">
<h3 id="orgaad2a3a"><span class="section-number-3">6.4</span> phpStudy</h3>
</div>
</div>
<div id="outline-container-orga035017" class="outline-2">
<h2 id="orga035017"><span class="section-number-2">7</span> References</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://baike.baidu.com/item/apache/6265">apache 百度百科</a></li>
</ul>
</div>
</div>
